// <원시타입>

// [1. 숫자]

// 자바스크립트는 하나의 숫자 타입만 존재한다.
// 자바스크립트의 숫자 타입은 정수만을 위한 타입이 없고, 모든 수를 실수로 처리한다.

// [2. 문자열]

// 텍스트 데이터를 나타내는 데 사용.
// ' ', " ", ` ` 으로 텍스트를 감싼다.

// (+) 템플릿 리터럴
// 용도 : 멀티라인 문자열 , 표현식 삽입, 태그드 탬플릿 등 편리한 문자열 처리 기능을 제공.

// (?) 이스케이프 시퀀스
// -> 일반 문자열 내에서 줄바꿈 등의 공백을 사용할때.

// [3. 불리언 타입]

// 불리언 타입의 값은 논리적 참, 거짓을 나타내는 true와 false 뿐이다.

// [4. undefined]

// undefined 타입의 값은 undefined 가 유일하다.
// var 키워드로 선언한 변수는 암묵적으로 undefined로 초기화된다.

// undefined는 개발자가 의도적으로 할당하기 위한 값이 아니라, 자바스크립트 엔진이 변수를 초기화 할 때 사용하는 값이다.
// 결론, 변수에 값이 없다는 것을 명시하고 싶을 경우, undefined가 아닌 null 을 할당하자.

// [5. null 타입]

// null 타입의 값은 null이 유일

// 변수에 값이 없다는 것을 의도적으로 명시할 때 사용하자.

// [6. 심벌 타입]

// <객체 타입>
